ABOUT = """
👤 *О себе*

Имя: Сайдгали Шынгыс
Возраст: 17 лет
Чем занимаюсь: Программированием

Пара фактов о себе:
• Я люблю Minecraft
• У меня есть кошка. Ее зовут Кнопа
"""

GOAL = """
🎯 *Моя цель*

Я хочу создать приложение полезное для людей, работать в IT-компании и т.д.
"""

HOW_I_CAME = """
🚀 *Как я пришёл в IT*

Впервые я столкнулся с программированием еще в детстве создавая карту в Minecraft для ютубера Кейна(безуспешно), и я научился пользоваться командными блоками
"""

MENTOR = """
🧑‍🏫 *Мой ментор*

Моего ментора зовут София. Она энергичная и веселая, помогает нам когда надо. Я очень ей благодарен за ее теплые слова и поддержку ❤️
"""

PROGRESS = """
📈 *Точка А → Точка Б*

*Точка А (начало):*
Знал только команду print()

*Точка Б (сейчас):*
Усвойл ООП, алгоритмы, геймдев, телеграм ботов и джанго
"""

HOBBIES = """
🎮 *Хобби и интересы*

Вне учёбы я увлекаюсь:
• Майнкрафтом и другими играми
• Фильмами и сериалами
• Спортом
• Катанием на велосипеде
"""

BEST_WORKS = [
    {
        "title": "Создание блога на Django",
        "description": "Разработал простой блог на фреймворке Django, в котором зарегистрированные пользователи могут публиковать, редактировать и просматривать статьи.",
        "link": "https://capeducation.getcourse.ru/pl/teach/control/lesson/view?id=341874495&editMode=0",
    },

    {
        "title": "Умное напоминание о воде",
        "description": "Написал программу которая помогает пользователям не забывать пить воду Он будет отправлять напоминания в заданное время, чтобы пользователь пил воду и следил за своим водным балансом.",
        "link": "https://capeducation.getcourse.ru/pl/teach/control/lesson/view?id=341874488&editMode=0",
    },

    {
        "title": "Образовательное приложение с карточками, викториной и заметками",
        "description": "Создал консольное которое помогает пользователям изучать новые темы",
        "link": "https://capeducation.getcourse.ru/pl/teach/control/lesson/view?id=341874479&editMode=0",
    },
]

GITHUB_LINK = "https://github.com/Shyn1845/CaPortfolio.git"
